{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "trainable": true, "output_shape_type": "raw", "name": "lambda_1", "function_type": "lambda", "input_dtype": "float32", "output_shape": null, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\"\u0001\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 24, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "subsample": [2, 2], "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 36, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_2", "nb_col": 5, "subsample": [2, 2], "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 48, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_3", "nb_col": 5, "subsample": [2, 2], "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "subsample": [1, 1], "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "subsample": [1, 1], "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 128, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 1152, "trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "name": "dense_1", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 32, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 128, "trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "name": "dense_2", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 8, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 32, "trainable": true, "W_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 0.0010000000474974513}, "name": "dense_3", "W_constraint": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_8", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1, "activation": "linear", "bias": true, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "input_dim": 8, "trainable": true, "W_regularizer": null, "name": "dense_4", "W_constraint": null, "b_regularizer": null}}]}